#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
aws_codestarconnections_connection.github_connection: Refreshing state... [id=arn:aws:codestar-connections:eu-west-1:802288441694:connection/1b430daa-4436-49d6-a3a6-bd27b73947db]
aws_cloudwatch_log_group.redis_cache_log_group: Refreshing state... [id=/cache/redis]
aws_cloudwatch_log_group.bff_service_log_group: Refreshing state... [id=/ecs/bff-service]
module.iam.aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
module.iam.data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
aws_cloudwatch_log_group.gtw_service_log_group: Refreshing state... [id=/ecs/gtw-service]
module.asics_cluster.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/asics_cluster]
module.iam.aws_iam_role.codepipeline_role: Refreshing state... [id=codepipeline-role]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
module.iam.data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
module.vpc.data.aws_availability_zones.available: Reading...
module.iam.aws_iam_role.codedeploy_role: Refreshing state... [id=codedeploy-role]
module.iam.aws_iam_role.codebuild_role: Refreshing state... [id=codebuild-role]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
module.iam.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-061517c67b227b30c]
module.iam.aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole]
module.iam.aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240905152951292300000007]
module.iam.aws_iam_role_policy.codepipeline_service_role_policy: Refreshing state... [id=codepipeline-role:terraform-20240905152951063500000001]
module.iam.aws_iam_role_policy_attachment.codepipeline_attach: Refreshing state... [id=codepipeline-role-20240905152951204900000004]
module.iam.aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-role:terraform-20240905152951068900000002]
module.iam.aws_iam_role_policy_attachment.codedeploy_attach: Refreshing state... [id=codedeploy-role-20240905152951221200000005]
aws_cloudwatch_log_stream.bff_service_log_stream: Refreshing state... [id=bff-service-log-stream]
aws_cloudwatch_log_stream.gtw_service_log_stream: Refreshing state... [id=gtw-service-log-stream]
aws_cloudwatch_log_stream.redis_cache_log_stream: Refreshing state... [id=redis-log-stream]
module.iam.aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-role:terraform-20240905152951089600000003]
module.iam.aws_iam_role_policy_attachment.codebuild_attach: Refreshing state... [id=codebuild-role-20240905152951331600000008]
aws_codebuild_project.build_project: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/bff-codebuild-project]
module.iam.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240905152951365400000009]
module.iam.aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole-20240905152951230800000006]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
module.vpc.aws_internet_gateway.gw: Refreshing state... [id=igw-0458a54ca292f7d3b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0cb3a003b39a76317]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06bca612ff40ca56a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fa599cfaf89baabd]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b009e3d26af314cc]
aws_security_group.gtw_lb: Refreshing state... [id=sg-03acdb2dde66103de]
module.bff_alb.aws_lb_target_group.tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/6afde97657007567]
module.gtw_alb.aws_lb_target_group.tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/c927e45b813c5abe]
module.vpc.aws_route.internet_access: Refreshing state... [id=r-rtb-0ee3dd4800c8d01201080289494]
aws_codepipeline.codepipeline: Refreshing state... [id=bff-pipeline]
aws_security_group.gtw_ecs_tasks: Refreshing state... [id=sg-0dd6b65a634dded31]
aws_elasticache_subnet_group.redis_subnet_group: Refreshing state... [id=redis-subnet-group]
module.gtw_alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/f7a7254f8bd3d580]
aws_security_group.lb: Refreshing state... [id=sg-0cec844cd76d5ef4a]
module.bff_alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/f3b49c1d0d2250b9]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0042fe3d797e6a3c1]
aws_security_group.redis_sg: Refreshing state... [id=sg-03f49e0bfcb8199e4]
module.gtw_alb.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/gtw-alb/f7a7254f8bd3d580/52ba4e4127bc60c3]
aws_elasticache_replication_group.redis: Refreshing state... [id=my-redis-cluster]
module.bff_alb.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/bff-alb/f3b49c1d0d2250b9/6a2877fd19f64867]
data.aws_elasticache_replication_group.redis_cluster: Reading...
data.aws_elasticache_replication_group.redis_cluster: Read complete after 0s [id=my-redis-cluster]
module.ecs_bff.aws_ecs_task_definition.task[0]: Refreshing state... [id=bff-task]
module.ecs_gtw.aws_ecs_task_definition.task[0]: Refreshing state... [id=gtw-task]
module.ecs_gtw.aws_ecs_service.service[0]: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics_cluster/bff-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-0042fe3d797e6a3c1"
        name                   = "cb-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.gtw_ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "gtw_ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-0dd6b65a634dded31"
        name                   = "gtw-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # module.ecs_bff.aws_ecs_service.service[0] will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:eu-west-1:802288441694:cluster/asics_cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bff-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:eu-west-1:802288441694:task-definition/bff-task:2"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bff-service"
          + container_port   = 8081
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/6afde97657007567"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0042fe3d797e6a3c1",
            ]
          + subnets          = [
              + "subnet-0b009e3d26af314cc",
              + "subnet-0cb3a003b39a76317",
            ]
        }
    }

  # module.ecs_gtw.aws_ecs_service.service[0] must be replaced
-/+ resource "aws_ecs_service" "service" {
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:eu-west-1:802288441694:service/asics_cluster/bff-service" -> (known after apply)
      ~ name                               = "bff-service" -> "gtw-service" # forces replacement
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ triggers                           = {} -> (known after apply)
        # (10 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*